INSERT INTO book_detail(title,author,pubdate,pages,isbn) VALUES
('黑客与画家','保罗·格雷厄姆 ',' 2011-4-12',264,'9787115249494'),
('代码大全','史蒂夫·迈克康奈尔 ','2006-3-11',944,'9787121022982'),
('设计模式','Erich Gamma','2000-9-01',254,'9787111075752'),
('算法导论','Clifford Stein ',' 2006-9-09',754,'9787111187776'),
('编译原理','Alfred V. Aho ','2008-12-19',631,'9787111251217'),
('编程珠玑','Jon Bentley ','2008-10-01',228,'9787115179289'),
('C程序设计语言','Brian W. Kernighan','2004-1-9',258,'9787111128069'),
('数据结构与算法分析','Mark Allen Weiss ','2004-1-1',391,'9787111127482'),
('代码整洁之道','Robert C·Martin ','2010-1-1',388,'9787115216878'),
('敏捷软件开发','Robert C·Martin ','2003-09-01',476,'9787302071976'),
('重构',' Martin Fowler ','2010-11-12',428,'9787115221704');